InformationRegisters/ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпьютерВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВерсииОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВерсийОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПроигнорирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ВерсииОбъектов/Ext/ManagerModule.bsl
// Записывает версию объекта в регистр сведений
   // Параметры
   // Ссылка        - СправочникСсылка / ДокументСсылка - ссылка на объект ИБ
   // ЧислоВерсийОбъекта - Число - число версий объекта
   // ХранилищеДанных - ХранилищеЗначения - хранилище с объектом ИБ (сериализованным в Fast InfoSet)
   //
   Процедура ЗаписатьВерсиюОбъекта(знач Ссылка,
	   знач ЧислоВерсийОбъекта,
	   знач ХранилищеДанных) Экспорт
	   
	   УстановитьПривилегированныйРежим(Истина);
	 
	   МенеджерЗаписиВерсииОбъектов = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
	   МенеджерЗаписиВерсииОбъектов.Объект        = Ссылка;
	   МенеджерЗаписиВерсииОбъектов.ДатаВерсии    = ТекущаяДата();
	   МенеджерЗаписиВерсииОбъектов.ВерсияОбъекта = ХранилищеДанных;
	   МенеджерЗаписиВерсииОбъектов.НомерВерсии   = Число(ЧислоВерсийОбъекта) + 1;
	   МенеджерЗаписиВерсииОбъектов.АвторВерсии   = глЗначениеПеременной("глТекущийПользователь");
	   
	   МенеджерЗаписиВерсииОбъектов.КомпьютерВерсии = ПараметрыСеанса.ТекущийКомпьютер;  //ПолучитьСерверТО().ПолучитьКомпьютерТО();
	   Попытка
		   МенеджерЗаписиВерсииОбъектов.Записать();
	   Исключение
		   Сообщить(НСтр("ru = '"+ОписаниеОшибки()+"'"), СтатусСообщения.Внимание);
	   КонецПопытки; 
   КонецПроцедуры
